; domain
(define (domain logistics)
(:requirements :typing)
(:types 	location vehicle package city - object
	airport - location
	truck airplane - vehicle
)

(:predicates (at ?obj - object ?loc - location)
	(in ?obj1 - package ?veh - vehicle)
	(in-city ?agent - truck ?loc - location ?city - city)
)

(:action load-truck
	:parameters   (?truck - truck ?obj - package ?loc - location)
	:precondition (and (at ?truck ?loc) (at ?obj ?loc))
	:effect       (and (in ?obj ?truck) (not (at ?obj ?loc))
))

(:action unload-truck
	:parameters   (?truck - truck ?obj - package ?loc - location)
	:precondition (and (in ?obj ?truck) (at ?truck ?loc))
	:effect       (and (at ?obj ?loc) (not (in ?obj ?truck))
))

(:action drive-truck
	:parameters   (?truck - truck ?loc-from - location ?loc-to - location ?city - city)
	:precondition (and (at ?truck ?loc-from) (in-city ?truck ?loc-from ?city) (in-city ?truck ?loc-to ?city))
	:effect       (and (at ?truck ?loc-to) (not (at ?truck ?loc-from))
))

(:action load-airplane
	:parameters   (?airplane - airplane ?obj - package ?loc - airport)
	:precondition (and (at ?obj ?loc) (at ?airplane ?loc))
	:effect       (and (in ?obj ?airplane) (not (at ?obj ?loc))
))

(:action unload-airplane
	:parameters   (?airplane - airplane ?obj - package ?loc - airport)
	:precondition (and (in ?obj ?airplane) (at ?airplane ?loc))
	:effect       (and (at ?obj ?loc) (not (in ?obj ?airplane))
))

(:action fly-airplane
	:parameters   (?airplane - airplane ?loc-from - airport ?loc-to - airport)
	:precondition (and )
	:effect       (and (at ?airplane ?loc-to) (not (at ?airplane ?loc-from))
))

)

; problem
(define (problem tiny_problem) (:domain logistics)
(:objects
	obj23 - package
	obj22 - package
	tru2 - truck
	apn1 - airplane
	obj21 - package
	apt2 - airport
	pos2 - location
	obj11 - package
	cit1 - city
	tru1 - truck
	pos1 - location
	obj12 - package
	obj13 - package
	apt1 - airport
	cit2 - city
)(:init
	(in-city tru1 pos1 cit1)
	(in-city tru2 apt2 cit2)
	(in-city tru2 pos2 cit2)
	(at obj21 pos2)
	(in-city tru1 apt1 cit1)
	(at obj23 pos2)
	(in obj13 tru1)
	(at tru1 apt1)
	(at obj11 pos2)
	(at obj12 pos2)
	(at tru2 apt2)
	(at apn1 apt1)
	(at obj22 apt1)
)(:goal (and 
	(at obj11 pos2)
	(at obj12 pos2)
	(at obj13 apt2)
	(at obj22 apt1)
)))

; plan
1. (unload-truck tru1 obj13 apt1)
   deleted: (in obj13 tru1)
   added: (at obj13 apt1)
   goals met: 3 of 4
2. (load-airplane apn1 obj13 apt1)
   deleted: (at obj13 apt1)
   added: (in obj13 apn1)
   goals met: 3 of 4
3. (fly-airplane apn1 apt1 apt2)
   deleted: (at apn1 apt1)
   added: (at apn1 apt2)
   goals met: 3 of 4
4. (unload-airplane apn1 obj13 apt2)
   deleted: (in obj13 apn1)
   added: (at obj13 apt2)
   goals met: 4 of 4
